# Récupérer la sortie calculée précédemment dans Jupyter Notebook

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame([["A", 1, 2], 
                   ["B", 3, 4],
                   ["C", 5, 6], 
                   ["A", 7, 8]], 
                  columns = ["col1", "col2", "col3"])

In [4]:
df.head()

  col1  col2  col3
0    A     1     2
1    B     3     4
2    C     5     6
3    A     7     8

In [5]:
df.groupby("col1").col2.mean().reset_index()

  col1  col2
0    A   4.0
1    B   3.0
2    C   5.0

In [6]:
Out[5]

  col1  col2
0    A   4.0
1    B   3.0
2    C   5.0

In [7]:
Out

{4:   col1  col2  col3
 0    A     1     2
 1    B     3     4
 2    C     5     6
 3    A     7     8,
 5:   col1  col2
 0    A   4.0
 1    B   3.0
 2    C   5.0,
 6:   col1  col2
 0    A   4.0
 1    B   3.0
 2    C   5.0}

In [8]:
type(Out)

dict